In [1]:
install pandas as pd

SyntaxError: invalid syntax (2367453110.py, line 1)

In [2]:
# Run this first to check your kernel & pandas
import sys
print("Python executable:", sys.executable)
print("Python version:", sys.version)

# Check pandas
import importlib
print("pandas installed?:", importlib.util.find_spec("pandas") is not None)

Python executable: C:\Users\Biswajit\anaconda3\envs\venv_20th_century-New\python.exe
Python version: 3.14.0 | packaged by conda-forge | (main, Oct 22 2025, 23:18:03) [MSC v.1944 64 bit (AMD64)]
pandas installed?: True

In [3]:
import pandas as pd

# Create test DataFrame with at least one text and one numeric column
data = pd.DataFrame({
    "Name": ['Aragorn', 'Boromir', 'Frodo', 'Galadriel', 'Legolas'],
    "Race": ["human", "human", "hobbit", "elf", "elf"],
    "Age": [88, 41, 51, 8382, 293],        # numeric
    "Score": [9.5, 7.2, 8.1, 9.9, 9.1]     # numeric
})

# Display the DataFrame
data

        Name    Race   Age  Score
0    Aragorn   human    88    9.5
1    Boromir   human    41    7.2
2      Frodo  hobbit    51    8.1
3  Galadriel     elf  8382    9.9
4    Legolas     elf   293    9.1

In [4]:
# Example: divide Score by 2 and save it to a new column
data['score_div_2'] = data['Score'].apply(lambda x: x / 2)

# Or using vectorized operation (faster)
# data['score_div_2'] = data['Score'] / 2

data.head()

        Name    Race   Age  Score  score_div_2
0    Aragorn   human    88    9.5         4.75
1    Boromir   human    41    7.2         3.60
2      Frodo  hobbit    51    8.1         4.05
3  Galadriel     elf  8382    9.9         4.95
4    Legolas     elf   293    9.1         4.55

In [5]:
# Create a boolean flag if Race == 'elf'
data['is_elf'] = data['Race'].apply(lambda x: True if x == 'elf' else False)

data[['Name', 'Race', 'is_elf']].head()

        Name    Race  is_elf
0    Aragorn   human   False
1    Boromir   human   False
2      Frodo  hobbit   False
3  Galadriel     elf    True
4    Legolas     elf    True

In [7]:
# Create a labelled flag column from Age
data['age_label'] = data['Age'].apply(
    lambda x: 'elven old' if x > 500 else ('middle-aged' if x >= 100 else 'young')
)

data[['Name', 'Age', 'age_label']].head()

        Name   Age    age_label
0    Aragorn    88        young
1    Boromir    41        young
2      Frodo    51        young
3  Galadriel  8382    elven old
4    Legolas   293  middle-aged